In [1]:
import pandas as pd

Transform data
1. Melt - wide to long format 
2. Piviot - long to wide format

In [4]:
df = pd.DataFrame(
    {
        "country": ["USA", "USA", "BD", "BD"],
        "year": [2020, 2021, 2020, 2021],
        "sales": [100, 120, 90, 110],
        "profit": [20, 25, 18, 22],
        "tax": [20, 12, 20, 18],
    }
)
df

  country  year  sales  profit  tax
0     USA  2020    100      20   20
1     USA  2021    120      25   12
2      BD  2020     90      18   20
3      BD  2021    110      22   18

In [5]:
df.melt(
    id_vars=["country", "year"],
    value_vars=["sales", "profit", "tax"],
    var_name="matrics",
    value_name="value",
)

   country  year matrics  value
0      USA  2020   sales    100
1      USA  2021   sales    120
2       BD  2020   sales     90
3       BD  2021   sales    110
4      USA  2020  profit     20
5      USA  2021  profit     25
6       BD  2020  profit     18
7       BD  2021  profit     22
8      USA  2020     tax     20
9      USA  2021     tax     12
10      BD  2020     tax     20
11      BD  2021     tax     18

In [7]:
df2 = pd.DataFrame({
    "Name": ["A", "B"],
    "Math": [85, 78],
    "Physics": [90, 82],
    "Chemistry": [88, 80]
})
df2

  Name  Math  Physics  Chemistry
0    A    85       90         88
1    B    78       82         80

In [8]:
df2.melt(
    id_vars="Name",
    value_vars=["Math", "Physics", "Chemistry"],
    var_name="Subjects",
    value_name="Marks",
)

  Name   Subjects  Marks
0    A       Math     85
1    B       Math     78
2    A    Physics     90
3    B    Physics     82
4    A  Chemistry     88
5    B  Chemistry     80